# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..Name Property
FabricationService Class See Also
---
The name of the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace